app/controllers/admin_controller.rb

  def bloquear_ip
    Multa.find(params[:id]).bloquear_ip
---
SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "28"]]

  def remover_blacklist
    Blacklist.find(params[:id]).update_attributes(:enabled => false)
---
SELECT "blacklists".* FROM "blacklists" WHERE "blacklists"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "blacklists" SET "enabled" = 'f', "updated_at" = '2011-12-26 04:03:30.215265' WHERE "blacklists"."id" = 5

  def show_multa
    @multa_show = Multa.find(params[:multa_id])
---
SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "28"]]