app/controllers/multas_controller.rb

SELECT "multas".* FROM "multas" ORDER BY data_ocorrencia DESC LIMIT 10
---
  def index
    offset = params[:p].to_i || 0
    @multas = Multa.visible.tem_foto_ou_video.find(:all, :order => "created_at DESC", :limit => MULTAS_POR_REQUEST, :offset => offset)
    @mais_novos_css_class = "atual"
    @mais_multados_css_class = ""
    @offset = Multa.visible.tem_foto_ou_video.size > offset + MULTAS_POR_REQUEST ? offset + MULTAS_POR_REQUEST : nil

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "12"]]
---
  def show
    @multa_show = Multa.visible.find(params[:id])

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @multa = Multa.find(params[:id])

INSERT INTO "multas" ("created_at", "creator_ip", "data_ocorrencia", "descricao", "foto", "foto_content_type", "foto_file_name", "foto_file_size", "foto_updated_at", "hidden", "likes", "placa", "updated_at", "video") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @multa = Multa.new(params[:multa])
    @multa.creator_ip = request.remote_ip

    respond_to do |format|
      if @multa.save

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "multas" SET "foto_file_name" = 'teste.png', "foto_content_type" = 'image/png', "foto_file_size" = 116408, "foto_updated_at" = '2011-12-18 03:07:20.127026', "updated_at" = '2011-12-18 03:07:20.170959' WHERE "multas"."id" = 1
---
  def update
    @multa = Multa.find(params[:id])

    respond_to do |format|
      if @multa.update_attributes(params[:multa])

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "11"]]
UPDATE "multas" SET "hidden" = 't', "updated_at" = '2011-12-19 02:45:16.586733' WHERE "multas"."id" = 16
---
  def destroy
    multa = Multa.find(params[:id])
    multa.update_attributes(:hidden => true)

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "17"]]
---
  def flag
    @multa_show = Multa.find(params[:multa_id])

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "17"]]
INSERT INTO "flags" ("created_at", "descricao", "motivo", "multa_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 18 Dec 2011 20:00:32 UTC +00:00], ["descricao", nil], ["motivo", nil], ["multa_id", 17], ["updated_at", Sun, 18 Dec 2011 20:00:32 UTC +00:00]]
SELECT COUNT(*) FROM "flags" WHERE "flags"."multa_id" = 17
UPDATE "multas" SET "hidden" = 't', "updated_at" = '2011-12-18 20:19:05.205299' WHERE "multas"."id" = 17
---
  def create_flag
    multa = Multa.find(params[:multa_id])
    flag = Flag.new(params[:flag])
    flag.multa = multa
    flag.save

    message = "Seu pedido de remoção foi recebido. A multa será retirada em instantes."

    # Remove automaticamente a multa caso atinja o limite máximo de flags
    if multa.flags.size > MAX_FLAGS
      multa.update_attributes(:hidden => true)

SELECT "multas".* FROM "multas" WHERE "multas"."id" = $1 LIMIT 1  [["id", "16"]]
UPDATE "multas" SET "likes" = 2, "updated_at" = '2011-12-19 01:09:32.084354' WHERE "multas"."id" = 1
---
  def like
    multa = Multa.find(params[:multa_id])
    multa.update_attributes(:likes => multa.likes + 1)